Revit 2026 API

# ConductorMaterial Properties

---

The ConductorMaterial type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Id | The Conductor Material id. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The Conductor Material name. |

#### Reference

ConductorMaterial Class

Autodesk.Revit.DB.Electrical Namespace